Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 男人说道：“马苦玄，按照你之前给出的理由，你是因为得知那外乡少女，在巷弄以一手飞剑术，联手大隋皇子和宦官，杀了你生平第一位师父，所以你心结难解，必须要在离开小镇之前报这个仇，我觉得这是说得通的，便没有阻拦你，由着你生死自负。毕竟修行中人，能够遇上这种大道之敌，既是危机，也是机遇。”
en_us: "Ma Kuxuan, according to excuse you gave me before, you wanted to head over there because of that young girl from the outside world. You told me that she teamed up with the prince and eunuch from the Great Sui Nation and used her flying sword to kill your first master. You told me that this left a knot in your heart, so you needed to find her to exact revenge. I felt like your request was reasonable, so I didn't stop you from going. I allowed you to take control of your own life and death. After all, being able to encounter such Dao enemies is both a danger and an opportunity for us cultivators and martial artists."

source: 男人负手而立，望向天空，问道：“假设少年真的给人意外之喜，本王借此机会插手其中，不管是和正阳山交好，还是与风雷园结盟，自然只可取其一，甚至难免会与另一方结怨，这相较于本王袖手旁观，任由大骊跟这两方势力始终不咸不淡，老死不相往来，对于我大骊来说，你觉得哪一种结果更好？”
en_us: Song Changjing stood with his hands clasped behind his back, looking up at the sky as he said, "If that boy really can give me a pleasant surprise, then I'll take that opportunity to get involved in this matter. Regardless of whether it's allying myself with the Sun Scorch Mountain or the Wind Lightning Field, there can only be one option and no way to befriend both powers. Alternatively, I could simply observe as a neutral bystander and allow the two powers to continue their cold war in our Great Li Empire. Which of those do you think is the best option for our Great Li Empire?"

source: 男人走回屋子，坐在主位上，仰头一口喝光杯中茶水，“最重要的是，本王玩弄这种无聊的小把戏，除了随便找个蹩脚理由，以便浑水摸鱼之外，也是想让你明白一个道理，在你接下来要走的修行路上，谁都有可能是你的敌人例如你的亲叔叔，我宋长镜。”
en_us: Song Changjing made his way back into the room, then sat down on the main seat before tipping his head back and downing all of the tea in his cup in one go. "I played this petty little trick on that boy not just so I can find a contrived reason to get involved in the conflict between the Sun Scorch Mountain and the Wind Lightning Field. In addition to that, I also wanted to teach you a lesson, which is that on your future path of cultivation, anyone could become your enemy, even me, your uncle."

source: 男人起身后，看到那个尚未进入真武山正式拜师祭祖的徒弟，正面向来时的方向，少年的嘴角、耳朵和鼻子都在淌血，使得那张黝黑脸庞，显得格外狰狞恐怖，少年抬起手臂胡乱擦拭一番，继续盯着那边。
en_us: When the man stood up, he saw that his disciple who was still yet to become a formal disciple of True Martial Mountain facing the direction that they had come from. Blood was seeping from Ma Kuxuan's mouth, ears, and nose, causing his tanned face to appear especially wicked and terrifying. He used his forearm to roughly wipe his blood away before continuing to stare in that direction.

source: 男人轻轻讥笑道：“玩猫抓耗子？得了吧，还不是想着以七分实力来打死陈平安外，同时还能让那少女掉以轻心，一箭双雕，想得倒是挺美。”
en_us: The man chuckled in ridicule and said, "Toy with him? Spare me! Was your plan not to kill him with 70% of your strength so that the young girl would underestimate you? And then you could kill her as well afterward, hitting two birds with one stone? Quite ambitious of you!"

source: 男人迅速转过头，不敢再看自己儿子，继续前行，喃喃道：“儿子，爹走了！”
en_us: The man hurriedly turned away, not daring to look at his son any longer. As he strode forward, he murmured to himself, "Goodbye, my son."

source: 男人还往自家闺女伤口上撒盐，“你要是不多嘴问刘羡阳的事情，爹也就睁yi只眼闭yi只眼了。”
en_us: The man continued to pour salt on his daughter's wounds, saying, "If you hadn't been so nosy and commented on Liu Xianyang's situatiuon, I would have simply turned a blind eye to your behavior."

source: 男人远远跟在少年身后，发现马苦玄经历过初期的热血上头后，脚步越来越慢，越来越轻松自如，最后就像是寻常少年在逛街。只是当那头黑猫从一处屋顶跳到少年肩头，再跳到地上，转头之后，飞奔离开，似乎是在告诉少年已经找到目标。在这之后，少年开始慢跑，再一次变了气质。
en_us: Keeping a large distance between himself and Ma Kuxuan, the swordsman noticed that the young boy's pace was gradually slowing down and becoming more relaxed after his initial burst of hot-headedness. In the end, he looked like an ordinary young boy strolling through the streets. However, this changed when the black cat jumped down from some rooftop and onto his shoulder, before turning around and sprinting away. It was as if the black cat were telling Ma Kuxuan that he had already found the target. Ma Kuxuan started to jog slowly, and his aura changed once again.

source: 男人随意道：“跪下后，面朝匾额，磕三个响头，把香火往地面上一插，就完事了。”
en_us: "Kneel down and face the plaque. Then kowtow three times and place the incense sticks in the ground. After that, you're all done," the man casually said.

source: 男人顺着少年的思路，问道：“你是想把虚无缥缈的善恶报应，上一辈人作下的孽，全部拢到自己身上，希望你奶奶和你爹娘能够善终？”
en_us: After listening to Ma Kuxuan's explanation, the man asked, "You want to collect the intangible karma from their evil deeds for yourself? You wish for your father and grandma to eventually die in peace?"

source: 男儿膝下有黄金。
en_us: A man's knees were plated in gold, so how could they kneel to others?

source: 男女的道袍样式，跟摆算命摊子的陆道长有些像，又有很多细节不同，道冠是最不一样的，陆道长是莲花冠，这两人头顶的道冠，则形若鱼尾。
en_us: The Daoist robes that the man and woman were wearing were slightly similar to the Daoist robes that Daoist Lu had worn. However, many of the details were different, and the Daoist hats that they wore were also extremely different. Daoist Lu had worn a lotus flower hat, while these two people were wearing a fish-tail shaped hat.

source: 男子开口说道：“你身体受伤不轻，千万别留下暗疾，否则会妨碍以后修行。”
en_us: "Your wounds are fairly significant, so be careful not to leave any hidden problems. Otherwise, your future cultivation will also be affected," the swordsman warned.

source: 男子死死盯住那根通红的剑胚子，沉声吩咐道：“心中默念《铸剑经w的撼龙篇！”
en_us: The man stared intently at the glowing red sword billet as he instructed in a deep voice, "Silently recite the Dragon Shaking Chapter of the Swordsmithing Scripture in your mind!"

source: 男子点了点头，打量了一眼高大少年，开门见山地问道：“少年，想不想去外边看看？比如投军入伍，上阵厮杀，我保证你只要熬得过十年，就能当上大官，到时候我亲自给你在京城摆酒庆功，如何？”
en_us: The man nodded in reply. He looked the broad young boy up and down and asked frankly, "Young boy, do you want to leave this place and see the outside world? For example, joining the army? If you can endure this for 10 years, I guarantee that you'll become a powerful official. At that time, I'll personally organize a banquet in the capital for you to celebrate your achievements. How does that sound?"

source: 男孩伸出手指，居高临下，厉色道：“坏了大事，本公子就将你剥皮抽筋，再把你的魂魄炼制成为灯芯，要你灯灭之前，时时刻刻生不如死！”
en_us: The boy also pointed a finger at Lu Zhengchun, regarding him like a servant as he warned, "If you screw this up, I'll skin you and pull out all of your tendons, then turn your soul into a flame to light a torch. Before that torch goes out, you'll constantly be in so much agony that you'll wish you were dead!"

source: 男孩哈哈大笑，快意至极，“杀杀杀，到时候让我爹就从咱们清风城内部杀起！自己人做的恶心事，才最恶心！”
en_us: The boy immediately began to chortle with glee upon hearing this. "That's what I like to hear! When that time comes, I'll get my father to start off by killing all of our clan members who spoke ill of us behind our backs! Those people are the most deplorable of all!"

source: 男孩嗤笑道：“老黄历再厚有何用，吃老本能吃几年？能够进来小镇的各方炼气士，就算比我们后来的那几拨，家家户户，谁家祖上没阔过？”
en_us: The little boy sneered and said, "What does it matter how many Sword Immortals they've produced? That's nothing but history! How much can it help them? Looking at the qi refiners who have the right to enter this small town, even those who came after us, which of their clans and sects hasn't been powerful before?"

source: 男孩愣了愣，随即停下脚步，无比恼火道：“既然那蠢丫头这么身世不俗，娘亲你为何不早就告知于我，我就不会一路上跟她针锋相对，惹得她有事没事就顶撞我，若是让我过几年娶了她做媳妇，以后再顺势结成道侣，对于我们清风城岂不是一桩大利好？！”
en_us: The little boy faltered upon hearing this. He immediately stopped in his tracks and said in anger, "If that stupid girl's so capable, why didn't you tell me earlier, mother? I wouldn't have targeted her all this time and caused her to always retort me for no reason. If she became my wife in a few years, and if we became Dao partners further down the track, wouldn't that have greatly benefited our Light Breeze City?!"

source: 男孩掰开妇人的手，眼神炙热，压低嗓音问道：“他家当真代代传承了宝甲和剑经？”
en_us: The boy pried the woman's hand aside with an excited look in his eyes as he lowered his voice and asked, "Has his clan really been passing down the prized armor and sword scripture for generations?"

source: 男孩有些幸灾乐祸，随口问道：“娘亲，这个姓卢的是不是失心疯了？以后咱们难道真要带着个疯子离开小镇，那多丢人现眼啊？”
en_us: Meanwhile, the little boy was taking great pleasure in Lu Zhengchun's misfortune, casually asking, "Mother, has he gone mad? Are we really going to take such a madman with us when we leave? Just how embarrassing will that be?"

source: 男孩比陈平安要矮大半个脑袋，孩子跟他擦身而过的时候，张了张嘴，虽然并没有发出声响，但是有明显的口型，应该是说了两个字，充满了挑衅。
en_us: The boy was almost a full head shorter then Chen Ping'an, and as he by Chen Ping'an, he opened his mouth, but didn't say anything. However, it was quite apparent that he had mouthed something very rude and provocative.

source: 男孩狠狠丢出一颗石头，砸在一尾鲤鱼背脊上，鲜血四溅，可怜鲤鱼疯狂拍打水面。
en_us: The boy hurled a rock viciously into the lake, and it struck one of the koi fish on the back. Blood was immediately sent splashing in all directions, while the poor koi fish flailed violently in pain.

source: 男孩皱眉道：“不然咧？”
en_us: The little boy frowned and said, "Otherwise?"

source: 男孩皱眉，等着答案。
en_us: The boy's brows furrowed slightly as he awaited further elaboration.

source: 男孩突然一本正经说道：“娘亲，我不喜欢跟在刘羡阳身后的那个家伙。第一眼起，就很不喜欢！”
en_us: The little boy suddenly became serious, and he said, "Mother, I don't like the person behind Liu Xianyang. In fact, I hated him at first sight!"

source: 男孩突然变换嬉笑脸色，从妇人怀中站起身后，眼神怜悯地俯视小女孩，像是学塾先生在训斥幼稚蒙童，“大道长生，逆天行事，只在争字。你连这点道理都不懂，以后如何继承家业，又如何恪守祖训？你们正阳山后裔，历代子孙务必每隔三十年，就需要拔高正阳山至少一百丈，臭丫头，你以为从你爷爷到你爹，做得很轻松不成？”
en_us: The boy suddenly stood up from the woman's lap, then looked down at the little girl with a sympathetic expression as he preached to her like a schoolteacher scolding a student. "The pursuit of the Great Dao is an endeavor that pits one against the natural order, so we must strive to secure every possible resource to help us on this journey. If you don't even understand such a simple concept, then how are you going to inherit your clan and uphold the teachings of your ancestors? Once every 30 years, the descendants of your Sun Scorch Mountain must elevate the mountain by at least 1,000 feet. Do you think that was an easy task for your father and your grandfather?"

source: 男孩突然撒娇道：“娘亲娘亲，咱们能不能跟小白家换一下宝物啊，咱们谋划的那具宝甲实在太丑了，娘亲你想啊，换成那部剑经的话，就能够梦中飞剑取头颅，当真是神不知鬼不觉，岂不是比一个乌龟壳厉害太多？”
en_us: The boy suddenly began to behave like a spoiled child as he urged, "Mother, Mother, can we trade treasures with them? The suit of prized armor that we're trying to obtain is hideous! Think about it, Mother, if we can get our hands on that sword scripture instead, we'll be able to decapitate people with flying swords! That's way more badass than an ugly turtle shell!"

source: 男孩笑过之后，很快冷静下来，突然想起一事，问道：“娘亲你这么戏耍正阳山，真是耍猴了，就不怕那头蠢猿万一回过神，离开小镇后就对我们大打出手？还有一件事，我始终没想明白，那个姓刘的，既然早早有了买瓷人，本身就根骨极好，加上有宝甲有剑经，这样的香饽饽，简直是少之又少，就连我也不得不承认，对他需要刮目相看，那么买瓷人为何迟迟不愿露面，使得娘亲你能够浑水摸鱼，还让那正阳山老猿帮咱们解决掉了烂摊子，他一拳打死刘羡阳后，什么都清净了，天大麻烦由正阳山来兜着，至于我们清风城，便有了极大的回旋余地。”
en_us: The boy then quickly calmed down, and a thought suddenly occurred to him as he said, "By doing this, we've really played the Sun Scorch Mountain for a fool. What if that stupid ape realizes what we've done and decide to attack us after we leave the town? Also, there's one other thing that I haven't been able to make sense of all this time. Liu Xianyang already has a porcelain buyer, and he possesses exceptional aptitude for cultivation. On top of that, he had both the suit of armor and the sword scripture in his possession. Someone as blessed as him is extremely rare, and even I have to admit that I was quite impressed by him. So why is it that his porcelain buyer has refrained from showing up all this time? Not only have they allowed us to secure this suit of armor, we were also able to get that old ape from the Sun Scorch Mountain to take the fall for us. Now that he's killed Liu Xianyang, we're completely in the clear. No matter what repercussions arise out of this, the Sun Scorch Mountain will be forced to bear them, while our Light Breeze City won't have to take any accountability."

source: 男孩笑道：“正阳山真是好大的威风！”
en_us: The little boy chuckled and said, "How mighty of the Sun Scorch Mountain!"

source: 男孩说着小镇百姓听不懂的话，“娘亲，这个姓刘的小虫子，祖上真是那位……”
en_us: The boy was speaking in a language that was foreign to the town's residents as he said, "Mother, is the ancestor of that little worm with the Liu surname really..."

source: 男孩转头做了个鬼脸，然后讥笑道：“臭丫头你自己也说了，是镇‘山’之宝，山门辈分而已，了不起啊？”
en_us: The boy turned to her and made a mocking face, then sneered, "You said it yourself just now, you dumb lass. It's the most prized treasure of your 'mountain', which doesn't mean anything in my eyes!"

source: 留下刘羡阳蹲在墙头自怨自艾。
en_us: He left Liu Xianyang to squat there and mope by himself.

source: 留到最后的那封信，陈平安需要送去给乡塾授业的教书先生，期间路过一座算命摊子，是个身穿老旧道袍的年轻道士，挺直腰杆坐镇桌后，他头戴一顶高冠，像一朵绽放的莲花。
en_us: The final letter that Chen Ping'an had to deliver was addressed to the teacher at the private school. Along the way, he passed by a fortune teller's stall, where a young ist priest in an old ist robe was seated behind a table with his back ramrod straight. He was wearing a tall hat that resembled a blooming lotus flower.

source: 疑神疑鬼的少年摇晃脑袋，看不够。
en_us: Chen Ping'an continued to stare at the piece of Dragon Slaying Platform with a bewildered expression.

source: 疼痛从肚子开始，到手脚，最后到脑袋。
en_us: The pain began in his stomach, but it quickly spread through his entire body.

source: 病榻上的女子已经骨瘦如柴，自然面目干枯丑陋。
en_us: That winter, the boy's mother had been tormented by her illness to the point that she was nothing more than a sack of skin and bones.

source: 白发老人蹲坐在她身边，轻声笑道：“小姐，如果卢家没有说谎，这份大机缘已经落入别人口袋了。”
en_us: The old man crouched down beside her as he chuckled, "Young Mistress, if the leader of the Lu Clan wasn't lying to us, then that creature has already fallen into someone else's hands."

source: 白发苍苍的老人笑道：“桃芽，你跟那送信少年样，亦是有心人啊。”
en_us: The old man smiled and replied, "Tao Ya, both you and that young boy are kind-hearted and determined people."

source: 白天自己无意间看到有个中年人，提着只鱼篓走在大街上，捕获了一尾巴掌长短的金黄鲤鱼，它在竹篓里蹦跳得厉害，陈平安只瞥了一眼，就觉得很喜庆，于是开口询问，能不能用十钱买下它，中年人本来只是想着犒劳犒劳自己的五脏庙，眼见有利可图，就坐地起价，狮子大开口，非要三十钱才肯卖。囊中羞涩的陈平安哪里有这么多闲钱，又实在舍不得那条金灿灿的鲤鱼，就眼馋跟着中年人，软磨硬泡，想着把价格砍到十五，哪怕是二十也行，就在中年人有松口迹象的时候，锦衣少年和高大老人正好路过，他们二话不说，用五十钱买走了鲤鱼和鱼篓，陈平安只能眼睁睁看着他们扬长而去，无可奈何。
en_us: Earlier in the day, he just so happened to spot a middle-aged man walking down the street while carrying a fish basket. He had caught a golden carp that was around the same length as a human hand, and it was flailing around vigorously in the bamboo basket. Chen Ping'an felt a sense of jubilation at the sight of the golden carp, and he asked the man if he was willing to sell the fish for 10 copper coins. The man had originally only intended to eat the fish, but he immediately jumped on the opportunity to make a profit from his catch, asking for an exorbitant price of 30 copper coins. The impoverished Chen Ping'an naturally didn't have that much spare money on his hands, but at the same time, he couldn't bear to leave the golden carp behind. Hence, he began to barter with the man, and he was willing to take the fish for 15 copper coins, even 20. Right as the man was beginning to show signs of relenting, the brocade-robed young boy and the old man just so happend to pass by, and they bought the carp and the fish basket for 50 copper coins without any hesitation, leaving Chen Ping'an to look on with a wistful expression.

source: 白天，那位气质温润如玉的年轻读书人，造访学塾，之后两人私下对话，远道而来的儒家君子问了他一个问题，“先生可想继承某人遗愿，继续为万世开太平？”
en_us: During the day, a young scholar with a gentle temperament had visited the school and had a private conversation with him. The Confucian scholar from far away had asked him, "Mr. Qi, do you want to inherit that person's dying wish? Do you want to bring peace and fortune to the world?"

source: 白猿咧嘴一笑，眼神阴森，“好家伙！原来是示威挑衅来了！”
en_us: A sinister grin appeared on Bai Yuan's face upon hearing this. "I see, so he did this as an act of intimidation and provocation! There's no need for any of you to investigate this matter any further. I know exactly who the assassin is, he's a boy from Clay Vase Alley."

source: 白猿皱眉问道：“那少年是不是身材瘦弱，皮肤黝黑，个头差不多只到这个高度。嗯，还有穿草鞋？”
en_us: Bai Yuan's brows furrowed slightly as he asked, "Was the culprit a thin boy with dark skin around this tall? Was he also wearing a pair of straw sandals?"

source: 白袍玉带的男人名义上是龙窑督造官，实则是大骊第一权势藩王，在他的带领下，宋集薪来到廊桥台阶底部，来之前，不但在官署沐浴更衣，还悬佩香囊，和一枚材质普通的龙形玉佩，色泽黯淡，毫不起眼。反倒是那块无论质地、品相还是寓意，都要更为出彩的老龙布雨玉佩，被那个男人强令摘掉，绝对不许悬佩。
en_us: On the surface, the man in white and wearing a jade belt was nothing more than the new kiln supervision official. In reality, however, he was actually the most powerful prince of the Great Li Empire. Following his lead, Song Jixin also arrived before the steps leading up to the covered bridge. Before coming here, not only had he bathed and changed in the kiln supervision office, but he had even attached a scented satched and a dragon-shaped jade pendant to his waist. The latter was made from ordinary material, and its color was already faded and unexceptional. Surprisingly, it was the Old Dragon Rainbringer jade pendant that was superior in terms of both omen and quality that Song Changjing had ordered him to remove. He wasn't allowed to wear it no matter what.

source: 白袍玉带的英俊男子站在宋集薪的房间，环顾四周，微微皱眉，“姓宋的他就给你安排了这么个寒酸地方？”
en_us: The handsome man in the white robe and jade belt was standing inside Song Jixin's room. As he looked around, he furrowed his brows slightly and said, "That person only organized such a shabby place for you?"

source: 白袍男人一笑置之，不以为意，“无妨，等你哪天有机会走出小镇，可以去最近的丹阳山口，找到一个叫刘临溪的武人，说是京城宋长镜举荐你来此投军，他若是不信，你就跟他讲那个叫宋长镜的人说了，你刘临溪还欠他三万颗大隋边骑的头颅。”
en_us: The man in white simply smiled in response, not seeming to mind. "No matter. When you have the opportunity to leave this small town one day, you can go to the nearby Danyang Mountain Pass and look for a martial artist called Liu Linxi. Just tell him that it was the capital's Song Changjing who recommended you to join the army. If he doesn't believe you, tell him that Song Changjing said that he still owes him 3000 enemy heads from the Great Sui Nation."

source: 白袍男人对此视而不见，双手扶住那根玉带，望向窗外的天空，微笑道：“也凭本王是大骊王朝武道第一人。”
en_us: The man in white ignored his changing expression. He placed both his hands on his jade belt and looked out the window, saying with a faint smile, "It's also because I'm the number one martial artist in the Great Li Empire."

source: 白袍男子带着少年宋集薪，在年迈管事的领路匣，赶往督造官衙署后厅。
en_us: With an old subordinate leading the way, the man in white led Song Jixin to the guest hall of the kiln supervision office.

source: 白鹿低下头颅，一个身穿大红棉袄的小女孩，则使劲踮起脚跟，伸手抚摸它的鹿角。
en_us: The white deer lowered its head, and a little girl wearing a bright red jacket did her best to get on her tippy-toes and stroke its antler.

source: 白鹿回到主人身边，她动作轻柔地摸了摸它的背脊，下一刻它便变成了一匹马的身姿。
en_us: The white deer returned to its owner's side, and the young Daoist nun gently stroked its back. In the next instant, the white deer transformed into a horse.

source: 白鹿微微加快步伐，小跑而至，绕着草鞋少年走了一圈，最后低下头颅，主动蹭了蹭贫寒少年。
en_us: The white deer slightly quickened its pace, jogging over and circling around the young boy once. It then lowered its head and nudged the impoverished young boy.

source: 百无聊赖的小女孩最后趴在石桌上，桌上放着一只鸟笼，装了一只好像叫捕蛇鹰的鸟，耷拉着脑袋，病恹恹的，羽毛灰不溜秋，一点都不好看，之前小女孩不管怎么逗弄，这只捕蛇鹰也不搭理她，所以她也觉得无趣乏味，现在她实在是没事找事，才对着那头扁毛畜牲吹口哨玩。
en_us: In the end, Tao Zi sat down and rested her chin on a stone table with a bored expression. There was a birdcage on the table, inside of which was a bird called a snake hunting hawk. It was hanging its head in a sickly fashion, and its feathers were completely dull and devoid of luster, giving it a rather shabby and unsightly appearance. No matter what Tao Zi did to try and get a reaction out of the bird, it refused to do anything, so she had grown quite bored of it. She had only returned to this fruitless endeavor of trying to play with the bird as there was simply nothing else for her to do.

source: 监造衙署每日都会建立一份密档，由九名大骊最顶尖的死士谍子，负责观察记录，上边所写，全部是“督造官宋大人的私生子”的日常琐碎，今日与婢女去逛了什么街，花了多少钱买了什么吃食货物，清晨朗诵的文章内容是哪本圣贤书籍，何时第一次偷偷喝酒，与谁一起去小镇外放纸鸢捉蟋蟀，因为何事、与何人在何地起了争执，等等等，事无巨细，全部记录在档案，然后每三个月一次寄往大骊京城，被送入那座皇宫的御书房桌上，最后汇聚一起编订成册，被那个最喜欢舞文弄墨的兄长，亲自命名为“小起居录”，从小起居录一，到如今的小起居录十五，一个十五岁的陋巷少年，十五年的点点滴滴，被人写成了十五本书。
en_us: The kiln supervision office would write up a secret document each day, and this was was the responsibility of nine top-notch guards and spies from the Great Li Empire. They were responsible for making the observations, and what they recorded was the daily activities of the "illegitimite son of the previous kiln supervision official". For example, what streets he shopped in with his maidservant Zhi Gui, how much money he spent on what food, what passages he recited in the morning and which Sages' works these came from, when did he secretly drink for the first time, who did he fly kites and catch crickets with outside the small town, who did he argue with and why, and so on and so forth. Regardless of how big or small the events, everything was observed and recorded. These records would then be delivered to the capital, where they would be taken into the palace and placed on the desk in the royal study. In the end, these records would be gathered together and binded into a book. His older brother — someone who loved to toy around with words and essays — personally named these books the "Small Records of Daily Life". From "Small Records of Daily Life 1" to "Small Records of Daily Life 15", everything that the 15-year-old boy living in the impoverished alley had done in his life had been recorded into 15 books.

source: 盘腿而坐的宁姚点头道：“也是。”
en_us: Sitting cross-legged, Ning Yao nodded and said, "That's true."

source: 直到宋集薪出现在门口，少年见到屋内并无椅子座位，便随意所在门槛上，望向屋内众人。
en_us: Thankfully, Song Jixin entered the room shortly thereafter to alleviate the awkward atmosphere. There were no spare chairs in the room, so he casually sat down onto the doorstep before turning his gaze to everyone in the room.

source: 直到走出卢家大宅后，卢正淳的脑子仍是一片空白。
en_us: Even after making his way out of the Lu Manor, Lu Zhengchun's mind was still completely blank.

source: 直到这个时候，宁姚才惊讶发现，原来陈平安裤管里边，小腿上还绑着一圈不厚不薄的沙袋。
en_us: Only at the moment did Ning Yao surprisingly discover a pouch of sand wrapped around each of Chen Ping'an's calves.

source: 直来直去。
en_us: He was frank and forthright.

source: 直距离道人眉心三寸的那把飞剑，迅猛前移寸。
en_us: The flying sword immediately advanced an inch further, bringing it to no more than two inches away from the Daoist priest's glabella.

source: 相比小镇内那些好似潜龙在渊的高龄前辈，一个个凝神屏气静心入定，少女的所作所为，实在是过于横行霸道了点。
en_us: Compared to the elderly seniors in the small town that were like dragons hiding in a deep pool, with their breathing paused and their attention focused, the young girl's movements truly appeared overly wild and domineering.

source: 相比陈平安这个名字的粗浅俗气，邻居少年就要雅致许多，叫宋集薪，就连与他相依为命的婢女，也有个绉绉的称呼，稚圭。
en_us: The neighboring boy's name was Song Jixin, a name that was far more sophisticated compared with Chen Ping'an's shallow and tacky name. Even his personal maidservant, Zhi Gui, had a very elegant name. [ref]The Ping'an (平安) in Chen Ping'an's name literally translates to safety, so it's a pretty shallow and on-the-nose name, whereas Song Jixin and Zhi Gui's names don't have any particularly clear meanings, but the combination of characters used is a lot more elegant and sophisticated.[/ref]

source: 相较于河婆老妪这种小棋子，能否真正成就神位，还是观湖书院要在大骊王朝，寻求一块围棋上的飞地，选中了那座披云山，其实老人对这些并不太上心，因为无举轻重。
en_us: Old Man Yang didn't really care about whether a minor pawn like the river guardian would actually be able to become a river god, or if Lake View Academy wanted to construct a branch on Cloud Drape Mountain. Neither of those matters were of any consequence to him.
